In [ ]:
import pandas as pd
#to create a series using python list:
river_lst=['Ganga','yamuna','kaveri','mahanadi','bramhaputra']
river_lst

In [ ]:
#to create a series
river_lst=pd.Series(river_lst)
river_lst

In [ ]:
#creating a series from array:
import numpy as np
arr1=np.array([10,20,30,40,50])
arr1
#to create a series:
pd.Series(arr1,dtype='int8')

In [ ]:
#To change the list using a,b,c nd d
pd.Series(arr1,index=list('abcde'))

In [ ]:
d={'a':100,'b':200,'c':300,'d':400}
pd.Series(d)
pd.Series(d,index=['a','b','c','d','e']) #if there is an extra variable in index it will only work for dictionary not for list or arrays
#that index will have none value.

In [ ]:
#indexing in pandas:it follows zero based indexing:
s1=pd.Series(d,index=['a','b','c','d','e'])
s1
print(s1['a'])
print(s1[1]) #even though we are given index ,it is folowing the zero based indexing,so we can call using numbers as well as shown here.
#slicing
print(s1['a':'c':1])
print(s1[1:4:1])
print(s1['e'])

In [ ]:
s1['a']=50
s1

In [2]:
#till now what i learnt:summary:
import pandas as pd
import numpy as np
#to repesent in series using pandas

#a.list
list1=['a','b','c','d']
list1=pd.Series(list)
list1

#b.array
arr1=np.arange(23,30)
arr1=pd.Series(arr1)
arr1

#we can name the index as 
arr2=np.arange(45,50)
arr2=pd.Series(arr2,index=['a','b','c','d','e'])
arr2

a    45
b    46
c    47
d    48
e    49
dtype: int64

### indexing and slicing of an array:

In [3]:
arr1=np.array([10,20,30,40,50])
arr1=pd.Series(arr1)
arr1
arr1[1:4:2]

#dictionary:
arr2={'a':100,'b':200,'c':300,'d':400}
arr2=pd.Series(arr2)
arr2
arr2['b':'d':1]

b    200
c    300
d    400
dtype: int64

In [4]:
state_lst=['UP','AP','MP','RJ','KA']
Capital_lst=['LKO','AMT','BHP','JAP','BRL']
a=pd.Series(state_lst,index=Capital_lst)
print(a)
a.values
a.index
a['LKO']
a['LKO':'JAP':1]

LKO    UP
AMT    AP
BHP    MP
JAP    RJ
BRL    KA
dtype: object

LKO    UP
AMT    AP
BHP    MP
JAP    RJ
dtype: object

In [5]:
#explicit indexing
a[:'JAP'] #it prints elements from begining till JAP

LKO    UP
AMT    AP
BHP    MP
JAP    RJ
dtype: object

In [6]:
a[['JAP','LKO']]

JAP    RJ
LKO    UP
dtype: object

In [9]:
#pandas data frame:
#collection of series:2dimensional ,mutable and heterogenous data:
#creating the empty data frame:
df=pd.DataFrame()
df
a=['india','usa','uk','singapore','australia','sweden','uae','newzealand']
a

#creating a data frame:
df2=pd.DataFrame(a,columns=['country_name'],index=[1,2,3,4,5,6,7,8])
df2

  country_name
1        india
2          usa
3           uk
4    singapore
5    australia
6       sweden
7          uae
8   newzealand

In [10]:
b=[3.287,9.834,0.242,0.72,7.69,0.45,0.83,0.268]
area_lst=pd.DataFrame(b,columns=['AREA'],index=[1,2,3,4,5,6,7,8])
print(area_lst)

    AREA
1  3.287
2  9.834
3  0.242
4  0.720
5  7.690
6  0.450
7  0.830
8  0.268

In [13]:
#combining two data frames:zip
country_area=list(zip(a,b))
c=pd.DataFrame(country_area,columns=['country','Area'],index=list(range(1,9)))
c

      country   Area
1       india  3.287
2         usa  9.834
3          uk  0.242
4   singapore  0.720
5   australia  7.690
6      sweden  0.450
7         uae  0.830
8  newzealand  0.268

In [15]:
a=pd.read_csv('w_data.csv')
a

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [18]:
#head function prints first five rows
#tail function will print last five rows
print(a.head())

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [17]:
print(a.tail())

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [20]:
#to specify how many rows we need to print w can use the below function:
a.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [24]:
a.tail(3)

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
a.shape

In [22]:
rows,columns=a.shape
rows

6

In [23]:
columns

4

In [25]:
#to slice this particular data frame:
a[3:5] #it will slice till 5-1

        day  temperature  windspeed event
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [26]:
a.index

RangeIndex(start=0, stop=6, step=1)

In [27]:
a.columns #it gives the name of columns.

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [30]:
#once we know the column names we can access th elements in each column as well as shown below:
a['day']
a['temperature'].max()

35

In [31]:
a['temperature'].min()

24

In [32]:
a['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [35]:
a.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [36]:
a.temperature.max()

35

In [37]:
a.temperature.min()

24

In [41]:
a.describe() 
#describe function is used to display the stastical data.
a.describe(include='all') #this include function is to run statistical function son all columns

             day  temperature  windspeed  event
count          6     6.000000   6.000000      6
unique         6          NaN        NaN      3
top     1/2/2017          NaN        NaN  Sunny
freq           1          NaN        NaN      2
mean         NaN    30.333333   4.666667    NaN
std          NaN     3.829708   2.338090    NaN
min          NaN    24.000000   2.000000    NaN
25%          NaN    28.750000   2.500000    NaN
50%          NaN    31.500000   5.000000    NaN
75%          NaN    32.000000   6.750000    NaN
max          NaN    35.000000   7.000000    NaN

In [43]:
#Different ways to create a data frame:
b=pd.read_csv('ted_data.csv')
b

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [45]:
b.describe()
b.columns

Index(['name_speaker', 'speaker_occupation', 'title', 'views', 'comments'], dtype='object')

In [46]:
b.name_speaker

0           Ken Robinson
1                Al Gore
2            David Pogue
3          Majora Carter
4           Hans Rosling
5           Tony Robbins
6          Julia Sweeney
7    Joshua Prince-Ramus
8            Dan Dennett
9            Rick Warren
Name: name_speaker, dtype: object

In [47]:
b.views.max()

47227110

In [48]:
b.views.min()

967741

In [50]:
c=pd.read_excel('football_worldcup.xlsx')
c

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

In [51]:
#ways to create a data frame

df_dict={'year':[1990,1994,1998,2002],'country':['italy','USA','France','Japan'],'winner':['Geramny','brazil','france','brazil'],'goalscored':[115,141,171,161]}
d=pd.DataFrame(df_dict)
d

   year country   winner  goalscored
0  1990   italy  Geramny         115
1  1994     USA   brazil         141
2  1998  France   france         171
3  2002   Japan   brazil         161

In [58]:
g=pd.DataFrame({'Winner':pd.Series(['germany','brazil','france'],index=[0,1,2]),'goalsscored':pd.Series([115,141,171,161],index=[0,1,2,3])})
g
g

    Winner  goalsscored
0  germany          115
1   brazil          141
2   france          171
3      NaN          161

In [60]:
h=[(2002,'japan','brazil',161),(2006,'germany','italy',147),(2010,'southafrica','spain',145),(2014,'brazil','germany',171)]
h1=pd.DataFrame(h,columns=['year','hostcountry','winner','goalscored'])
h1

   year  hostcountry   winner  goalscored
0  2002        japan   brazil         161
1  2006      germany    italy         147
2  2010  southafrica    spain         145
3  2014       brazil  germany         171

In [64]:
#combining two series
v=pd.DataFrame({'country':pd.Series(['India','africa','america'],index=[0,1,2]),'Goalscored':pd.Series([161,123,145,161],index=[0,1,2,3])})
v

   country  Goalscored
0    India         161
1   africa         123
2  america         145
3      NaN         161

In [66]:
#creating dataframe from list of dictionary:
s=[{'year':2002,'hostcountry':'japan','winner':'brazil'},{'year':2004,'hostcountry':'china','winner':'brazil'},{'year':2009,'hostcountry':'japan','winner':'brazil'},{'year':2006,'hostcountry':'japan','winner':'india'}]
s1=pd.DataFrame(s)

In [68]:
s=[{'year':2002,'hostcountry':'japan','winner':'brazil'},{'year':2004,'hostcountry':'china','winner':'brazil'},{'year':2009,'hostcountry':'japan','winner':'brazil'},{'year':2006,'hostcountry':'japan','winner':'india'}]
s1=pd.DataFrame(s)
s1

   year hostcountry  winner
0  2002       japan  brazil
1  2004       china  brazil
2  2009       japan  brazil
3  2006       japan   india